# HorizontalAlignment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement..::..HorizontalAlignment Property
TextElement Class See Also
---
Horizontal alignment of the text content within the text area of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public HorizontalTextAlignment HorizontalAlignment { get; set; }
```

Visual Basic
---
```text
Public Property HorizontalAlignment As HorizontalTextAlignment
	Get
	Set
```

Visual C++
---
```text
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
	void set (HorizontalTextAlignment value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TextElement Class
Autodesk.Revit.DB Namespace